###################################################################

# Created by write_sdc on Sun May 25 18:51:58 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 1 [get_ports {ciphertext[7]}]
set_load -pin_load 1 [get_ports {ciphertext[6]}]
set_load -pin_load 1 [get_ports {ciphertext[5]}]
set_load -pin_load 1 [get_ports {ciphertext[4]}]
set_load -pin_load 1 [get_ports {ciphertext[3]}]
set_load -pin_load 1 [get_ports {ciphertext[2]}]
set_load -pin_load 1 [get_ports {ciphertext[1]}]
set_load -pin_load 1 [get_ports {ciphertext[0]}]
set_load -pin_load 1 [get_ports ciphertext_valid]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
group_path -name FEEDTHROUGH  -from [list [get_ports rst_n] [get_ports {plaintext[7]}] [get_ports {plaintext[6]}] [get_ports {plaintext[5]}] [get_ports {plaintext[4]}] [get_ports {plaintext[3]}] [get_ports {plaintext[2]}] [get_ports {plaintext[1]}] [get_ports {plaintext[0]}] [get_ports key_valid_in] [get_ports plaintext_valid_in] [get_ports {key[33]}] [get_ports {key[32]}] [get_ports {key[31]}] [get_ports {key[30]}] [get_ports {key[29]}] [get_ports {key[28]}] [get_ports {key[27]}] [get_ports {key[26]}] [get_ports {key[25]}] [get_ports {key[24]}] [get_ports {key[23]}] [get_ports {key[22]}] [get_ports {key[21]}] [get_ports {key[20]}] [get_ports {key[19]}] [get_ports {key[18]}] [get_ports {key[17]}] [get_ports {key[16]}] [get_ports {key[15]}] [get_ports {key[14]}] [get_ports {key[13]}] [get_ports {key[12]}] [get_ports {key[11]}] [get_ports {key[10]}] [get_ports {key[9]}] [get_ports {key[8]}] [get_ports {key[7]}] [get_ports {key[6]}] [get_ports {key[5]}] [get_ports {key[4]}] [get_ports {key[3]}] [get_ports {key[2]}] [get_ports {key[1]}] [get_ports {key[0]}]]  -to [list [get_ports {ciphertext[7]}] [get_ports {ciphertext[6]}] [get_ports {ciphertext[5]}] [get_ports {ciphertext[4]}] [get_ports {ciphertext[3]}] [get_ports {ciphertext[2]}] [get_ports {ciphertext[1]}] [get_ports {ciphertext[0]}] [get_ports ciphertext_valid]]
group_path -name REGIN  -from [list [get_ports rst_n] [get_ports {plaintext[7]}] [get_ports {plaintext[6]}] [get_ports {plaintext[5]}] [get_ports {plaintext[4]}] [get_ports {plaintext[3]}] [get_ports {plaintext[2]}] [get_ports {plaintext[1]}] [get_ports {plaintext[0]}] [get_ports key_valid_in] [get_ports plaintext_valid_in] [get_ports {key[33]}] [get_ports {key[32]}] [get_ports {key[31]}] [get_ports {key[30]}] [get_ports {key[29]}] [get_ports {key[28]}] [get_ports {key[27]}] [get_ports {key[26]}] [get_ports {key[25]}] [get_ports {key[24]}] [get_ports {key[23]}] [get_ports {key[22]}] [get_ports {key[21]}] [get_ports {key[20]}] [get_ports {key[19]}] [get_ports {key[18]}] [get_ports {key[17]}] [get_ports {key[16]}] [get_ports {key[15]}] [get_ports {key[14]}] [get_ports {key[13]}] [get_ports {key[12]}] [get_ports {key[11]}] [get_ports {key[10]}] [get_ports {key[9]}] [get_ports {key[8]}] [get_ports {key[7]}] [get_ports {key[6]}] [get_ports {key[5]}] [get_ports {key[4]}] [get_ports {key[3]}] [get_ports {key[2]}] [get_ports {key[1]}] [get_ports {key[0]}]]
group_path -name REGOUT  -to [list [get_ports {ciphertext[7]}] [get_ports {ciphertext[6]}] [get_ports {ciphertext[5]}] [get_ports {ciphertext[4]}] [get_ports {ciphertext[3]}] [get_ports {ciphertext[2]}] [get_ports {ciphertext[1]}] [get_ports {ciphertext[0]}] [get_ports ciphertext_valid]]
set_input_delay -clock clk  2  [get_ports rst_n]
set_input_delay -clock clk  2  [get_ports {plaintext[7]}]
set_input_delay -clock clk  2  [get_ports {plaintext[6]}]
set_input_delay -clock clk  2  [get_ports {plaintext[5]}]
set_input_delay -clock clk  2  [get_ports {plaintext[4]}]
set_input_delay -clock clk  2  [get_ports {plaintext[3]}]
set_input_delay -clock clk  2  [get_ports {plaintext[2]}]
set_input_delay -clock clk  2  [get_ports {plaintext[1]}]
set_input_delay -clock clk  2  [get_ports {plaintext[0]}]
set_input_delay -clock clk  2  [get_ports key_valid_in]
set_input_delay -clock clk  2  [get_ports plaintext_valid_in]
set_input_delay -clock clk  2  [get_ports {key[33]}]
set_input_delay -clock clk  2  [get_ports {key[32]}]
set_input_delay -clock clk  2  [get_ports {key[31]}]
set_input_delay -clock clk  2  [get_ports {key[30]}]
set_input_delay -clock clk  2  [get_ports {key[29]}]
set_input_delay -clock clk  2  [get_ports {key[28]}]
set_input_delay -clock clk  2  [get_ports {key[27]}]
set_input_delay -clock clk  2  [get_ports {key[26]}]
set_input_delay -clock clk  2  [get_ports {key[25]}]
set_input_delay -clock clk  2  [get_ports {key[24]}]
set_input_delay -clock clk  2  [get_ports {key[23]}]
set_input_delay -clock clk  2  [get_ports {key[22]}]
set_input_delay -clock clk  2  [get_ports {key[21]}]
set_input_delay -clock clk  2  [get_ports {key[20]}]
set_input_delay -clock clk  2  [get_ports {key[19]}]
set_input_delay -clock clk  2  [get_ports {key[18]}]
set_input_delay -clock clk  2  [get_ports {key[17]}]
set_input_delay -clock clk  2  [get_ports {key[16]}]
set_input_delay -clock clk  2  [get_ports {key[15]}]
set_input_delay -clock clk  2  [get_ports {key[14]}]
set_input_delay -clock clk  2  [get_ports {key[13]}]
set_input_delay -clock clk  2  [get_ports {key[12]}]
set_input_delay -clock clk  2  [get_ports {key[11]}]
set_input_delay -clock clk  2  [get_ports {key[10]}]
set_input_delay -clock clk  2  [get_ports {key[9]}]
set_input_delay -clock clk  2  [get_ports {key[8]}]
set_input_delay -clock clk  2  [get_ports {key[7]}]
set_input_delay -clock clk  2  [get_ports {key[6]}]
set_input_delay -clock clk  2  [get_ports {key[5]}]
set_input_delay -clock clk  2  [get_ports {key[4]}]
set_input_delay -clock clk  2  [get_ports {key[3]}]
set_input_delay -clock clk  2  [get_ports {key[2]}]
set_input_delay -clock clk  2  [get_ports {key[1]}]
set_input_delay -clock clk  2  [get_ports {key[0]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[7]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[6]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[5]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[4]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[3]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[2]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[1]}]
set_output_delay -clock clk  1  [get_ports {ciphertext[0]}]
set_output_delay -clock clk  1  [get_ports ciphertext_valid]
set_input_transition -max 0.1  [get_ports rst_n]
set_input_transition -min 0.1  [get_ports rst_n]
set_input_transition -max 0.1  [get_ports {plaintext[7]}]
set_input_transition -min 0.1  [get_ports {plaintext[7]}]
set_input_transition -max 0.1  [get_ports {plaintext[6]}]
set_input_transition -min 0.1  [get_ports {plaintext[6]}]
set_input_transition -max 0.1  [get_ports {plaintext[5]}]
set_input_transition -min 0.1  [get_ports {plaintext[5]}]
set_input_transition -max 0.1  [get_ports {plaintext[4]}]
set_input_transition -min 0.1  [get_ports {plaintext[4]}]
set_input_transition -max 0.1  [get_ports {plaintext[3]}]
set_input_transition -min 0.1  [get_ports {plaintext[3]}]
set_input_transition -max 0.1  [get_ports {plaintext[2]}]
set_input_transition -min 0.1  [get_ports {plaintext[2]}]
set_input_transition -max 0.1  [get_ports {plaintext[1]}]
set_input_transition -min 0.1  [get_ports {plaintext[1]}]
set_input_transition -max 0.1  [get_ports {plaintext[0]}]
set_input_transition -min 0.1  [get_ports {plaintext[0]}]
set_input_transition -max 0.1  [get_ports key_valid_in]
set_input_transition -min 0.1  [get_ports key_valid_in]
set_input_transition -max 0.1  [get_ports plaintext_valid_in]
set_input_transition -min 0.1  [get_ports plaintext_valid_in]
set_input_transition -max 0.1  [get_ports {key[33]}]
set_input_transition -min 0.1  [get_ports {key[33]}]
set_input_transition -max 0.1  [get_ports {key[32]}]
set_input_transition -min 0.1  [get_ports {key[32]}]
set_input_transition -max 0.1  [get_ports {key[31]}]
set_input_transition -min 0.1  [get_ports {key[31]}]
set_input_transition -max 0.1  [get_ports {key[30]}]
set_input_transition -min 0.1  [get_ports {key[30]}]
set_input_transition -max 0.1  [get_ports {key[29]}]
set_input_transition -min 0.1  [get_ports {key[29]}]
set_input_transition -max 0.1  [get_ports {key[28]}]
set_input_transition -min 0.1  [get_ports {key[28]}]
set_input_transition -max 0.1  [get_ports {key[27]}]
set_input_transition -min 0.1  [get_ports {key[27]}]
set_input_transition -max 0.1  [get_ports {key[26]}]
set_input_transition -min 0.1  [get_ports {key[26]}]
set_input_transition -max 0.1  [get_ports {key[25]}]
set_input_transition -min 0.1  [get_ports {key[25]}]
set_input_transition -max 0.1  [get_ports {key[24]}]
set_input_transition -min 0.1  [get_ports {key[24]}]
set_input_transition -max 0.1  [get_ports {key[23]}]
set_input_transition -min 0.1  [get_ports {key[23]}]
set_input_transition -max 0.1  [get_ports {key[22]}]
set_input_transition -min 0.1  [get_ports {key[22]}]
set_input_transition -max 0.1  [get_ports {key[21]}]
set_input_transition -min 0.1  [get_ports {key[21]}]
set_input_transition -max 0.1  [get_ports {key[20]}]
set_input_transition -min 0.1  [get_ports {key[20]}]
set_input_transition -max 0.1  [get_ports {key[19]}]
set_input_transition -min 0.1  [get_ports {key[19]}]
set_input_transition -max 0.1  [get_ports {key[18]}]
set_input_transition -min 0.1  [get_ports {key[18]}]
set_input_transition -max 0.1  [get_ports {key[17]}]
set_input_transition -min 0.1  [get_ports {key[17]}]
set_input_transition -max 0.1  [get_ports {key[16]}]
set_input_transition -min 0.1  [get_ports {key[16]}]
set_input_transition -max 0.1  [get_ports {key[15]}]
set_input_transition -min 0.1  [get_ports {key[15]}]
set_input_transition -max 0.1  [get_ports {key[14]}]
set_input_transition -min 0.1  [get_ports {key[14]}]
set_input_transition -max 0.1  [get_ports {key[13]}]
set_input_transition -min 0.1  [get_ports {key[13]}]
set_input_transition -max 0.1  [get_ports {key[12]}]
set_input_transition -min 0.1  [get_ports {key[12]}]
set_input_transition -max 0.1  [get_ports {key[11]}]
set_input_transition -min 0.1  [get_ports {key[11]}]
set_input_transition -max 0.1  [get_ports {key[10]}]
set_input_transition -min 0.1  [get_ports {key[10]}]
set_input_transition -max 0.1  [get_ports {key[9]}]
set_input_transition -min 0.1  [get_ports {key[9]}]
set_input_transition -max 0.1  [get_ports {key[8]}]
set_input_transition -min 0.1  [get_ports {key[8]}]
set_input_transition -max 0.1  [get_ports {key[7]}]
set_input_transition -min 0.1  [get_ports {key[7]}]
set_input_transition -max 0.1  [get_ports {key[6]}]
set_input_transition -min 0.1  [get_ports {key[6]}]
set_input_transition -max 0.1  [get_ports {key[5]}]
set_input_transition -min 0.1  [get_ports {key[5]}]
set_input_transition -max 0.1  [get_ports {key[4]}]
set_input_transition -min 0.1  [get_ports {key[4]}]
set_input_transition -max 0.1  [get_ports {key[3]}]
set_input_transition -min 0.1  [get_ports {key[3]}]
set_input_transition -max 0.1  [get_ports {key[2]}]
set_input_transition -min 0.1  [get_ports {key[2]}]
set_input_transition -max 0.1  [get_ports {key[1]}]
set_input_transition -min 0.1  [get_ports {key[1]}]
set_input_transition -max 0.1  [get_ports {key[0]}]
set_input_transition -min 0.1  [get_ports {key[0]}]
